# Pandas Tasks

In the task below, you will practice what you have learnt in the pandas tutorial.

## Task 1

#### Question 1. Identify two ways of creating a pandas DataFrame and create a dataframe with ten columns and twenty rows for each way

In [15]:
import pandas as pd
# 1. using a list
names = ['Abubakar', 'Alaro', 'Academy', 'Yabebal', 'Arun', 'Abuton', 'pandas', 'task',
        'Precious', 'AbdulMaleek', 'Amina', 'Lawal', 'Lateef', 'Sulyman', 'Lordghost',
        'Sharma', 'Bolaji', 'Abdulroqeeb', 'Adejoke', 'Maryam']
scores = [80, 77,67, 87, 67, 45, 32, 67, 90, 56, 88, 65, 4, 6, 66, 37, 60, 88, 66, 77]
age = [21, 13, 33, 22, 27, 18, 19, 15, 12, 18, 19, 24, 27, 45, 58, 59, 12, 12, 19, 21]
sex = ['male','male','male','male','male','male','male','male','male','male','male','male',
      'male', 'female','female','female','female','female','female','female']
subject = ['math', 'english', 'physics', 'math', 'english', 'chemistry', 'math', 'physics', 'math',
          'biology', 'physics', 'chemistry', 'math', 'english', 'english', 'math', 'biology',
           'physics', 'english', 'biology']
height = [8.2, 7.5,6.3, 8.6, 6.6, 4.3, 3.2, 6.7, 9.10, 5.46, 8.8, 6.5, 4.8, 6.6, 6.6, 3.7, 6.0,
          8.8, 6.6, 7.7]
weight = [80, 77,67, 87, 67, 45, 32, 67, 90, 56, 88, 65, 4, 6, 66, 37, 60, 88, 66, 77]
hobby =  ['swimming', 'dancing', 'football', 'hiking', 'skating', 'jumping', 'laughing',
          'swimming', 'football', 'dancing', 'physics', 'hiking', 'dancing', 'dancing', 
          'hiking', 'swimming', 'biology',  'laughing', 'laughing', 'hiking']
sports = ['football', 'basketball', 'football', 'football', 'skating', 'f1', 'hockey',
          'tennis', 'football', 'vollyball', 'cricket', 'f1', 'badmiton', 'basketball', 
          'basketball', 'cricket', 'cricket',  'badmiton', 'cricket', 'basketball']
gp = [3.2, 3.5,2.3, 4.6, 1.6, 4.3, 3.2, 2.7, 1.10, 5.0, 4.8, 4.5, 4.8, 3.6, 1.6, 3.7, 2.0, 4.8, 3.2, 1]

# using a list
df_using_list = pd.DataFrame(zip(names, scores, age, sex, subject, height, weight, hobby, sports, gp),
                            columns=['Name', 'Scores', 'Age', 'Sex', 'Subject', 'Height', 'Weight',
                                    'Hobby', 'Sport', 'Gp'])
df_using_list.head()

,Name,Scores,Age,Sex,Subject,Height,Weight,Hobby,Sport,Gp
0,Abubakar,80,21,male,math,8.2,80,swimming,football,3.2
1,Alaro,77,13,male,english,7.5,77,dancing,basketball,3.5
2,Academy,67,33,male,physics,6.3,67,football,football,2.3
3,Yabebal,87,22,male,math,8.6,87,hiking,football,4.6
4,Arun,67,27,male,english,6.6,67,skating,skating,1.6

In [18]:
df_using_list.shape

(20, 10)

#### Question 2. Show a summary of your dataframe with column names, non null count and dtypes for the columns

In [20]:
df_using_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     20 non-null     object
 1   Scores   20 non-null     int64
 2   Age      20 non-null     int64
 3   Sex      20 non-null     object
 4   Subject  20 non-null     object
 5   Height   20 non-null     float64
 6   Weight   20 non-null     int64
 7   Hobby    20 non-null     object
 8   Sport    20 non-null     object
 9   Gp       20 non-null     float64
dtypes: float64(2), int64(3), object(5)
memory usage: 1.7+ KB

#### Question 3. Again show a summary of your dataframe, this time, showing the mean, count, standard deviation, minimum number etc for all the numerical columns

In [21]:
df_using_list.describe()

          Scores        Age     Height     Weight         Gp
count  20.000000  20.000000  20.000000  20.000000  20.000000
mean   61.250000  24.700000   6.603000  61.250000   3.275000
std    25.124689  13.981567   1.697977  25.124689   1.318642
min     4.000000  12.000000   3.200000   4.000000   1.000000
25%    53.250000  17.250000   5.865000  53.250000   2.225000
50%    66.500000  20.000000   6.600000  66.500000   3.350000
75%    77.750000  27.000000   7.825000  77.750000   4.525000
max    90.000000  59.000000   9.100000  90.000000   5.000000

#### Question 4. Show the number of unique values in all the columns in your dataframe